Revit 2024 API
IFCTransaction.Commit Method
 Commits all changes made to the IFC file during the transaction.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public void Commit()
Visual Basic
Public Sub Commit
Visual C++
public:
void Commit()
See Also
IFCTransaction Class
Autodesk.Revit.DB.IFC Namespace